In [ ]:
import requests
import pandas as pd

url='https://api.coindesk.com/v1/bpi/currentprice.json'

try:
    resp=requests.get(url)#HTTP VERB GET 

    if resp.status_code==200:
        btcstockprice=resp.json()
        btcDF=pd.DataFrame(btcstockprice)
        if not btcDF.empty:
            #display(btcDF)
            print(btcDF.shape)
            print(btcDF.shape[0])
    else:
        print('Failuer'+str(resp.status_code))
except Exception as error:
    print('some error occured',error)

In [ ]:
#exception handing..
import logging #Debug,Info,Error,Critical,Warning

try:
    logging.debug('enter into program')
    logging.info('enter into program')
    res=56/0
except Exception as error:
    print('Exception',type(error).__name__)
    logging.exception(error)
finally:
    print('SUCCESSFUL')

In [ ]:
#pip install pandas

In [ ]:
import sys
!(sys.executable) -m pip install requirements.txt

In [ ]:
import this

In [15]:
x,y=20,30
x,y=y,x
str = '21/01/2017'
from datetime import datetime
today=datetime.today()
currenttime=datetime.now().strftime('%H:%M:%S')

currentday=datetime.now().strftime('%d/%m/%Y')
print(today)
print(currenttime)
print(currentday)

2024-05-13 14:01:09.665927
14:01:09
13/05/2024

In [2]:
import calendar
month=calendar.month(2024,5)
print(month)

      May 2024
Mo Tu We Th Fr Sa Su
       1  2  3  4  5
 6  7  8  9 10 11 12
13 14 15 16 17 18 19
20 21 22 23 24 25 26
27 28 29 30 31

In [3]:
import pandas as pd

data={"cars":["Honda","BMW","Audi"],"cost":[1000,2000,3000]}
cardf=pd.DataFrame(data)
display(cardf)

cardf.head(2)
cardf.tail(2)
cardf.info()

#cardf.loc[30]

cardf.query("cars=='BMW'")

cars_name=["BMW","Audi"]
cardf.query("cars in @cars_name")#@ is used to refer a variable name

    cars  cost
0  Honda  1000
1    BMW  2000
2   Audi  3000

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   cars    3 non-null      object
 1   cost    3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

   cars  cost
1   BMW  2000
2  Audi  3000

In [7]:
data2={"cars":["Honda","BMW","Benz"],"cost":[1000,2000,3000]}

dupcardf=pd.DataFrame(data2,index=[60,70,80])

cancatdf=pd.concat([cardf,dupcardf])

display(cancatdf)

     cars  cost
0   Honda  1000
1     BMW  2000
2    Audi  3000
60  Honda  1000
70    BMW  2000
80   Benz  3000

In [8]:
dedupcardf=cancatdf.drop_duplicates()# removes duplicates from data frame
display(dedupcardf)

     cars  cost
0   Honda  1000
1     BMW  2000
2    Audi  3000
80   Benz  3000

In [9]:
dedupcardf["cars"]=dedupcardf["cars"].str.lower()# update all records to lower case

display(dedupcardf)

C:\Users\Santosh_Kumar_Panda1\AppData\Local\Temp\ipykernel_24876\794318122.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dedupcardf["cars"]=dedupcardf["cars"].str.lower()# update all records to lower case

     cars  cost
0   honda  1000
1     bmw  2000
2    audi  3000
80   benz  3000

In [10]:
print('total records',dedupcardf.count())#count no of rows

print('total records',dedupcardf.shape[0])#count no of rows

print('total records',dedupcardf.shape[1])#count no of cols

total records cars    4
cost    4
dtype: int64
total records 4
total records 2

In [11]:
for i in dedupcardf.index:
    if dedupcardf.loc[i,'cost'] > 1000:
        dedupcardf.loc[i,'cost']= dedupcardf.loc[i,'cost'] +500

#update the record on condition

display(dedupcardf)

     cars  cost
0   honda  1000
1     bmw  2500
2    audi  3500
80   benz  3500

In [12]:
#remove the record on condition
for i in dedupcardf.index:
    if dedupcardf.loc[i,'cars'] == "audi":
        dedupcardf.drop(i,inplace=True)

display(dedupcardf)

C:\Users\Santosh_Kumar_Panda1\AppData\Local\Temp\ipykernel_24876\3431114737.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dedupcardf.drop(i,inplace=True)

     cars  cost
0   honda  1000
1     bmw  2500
80   benz  3500

In [6]:
import requests
import pandas as pd

url='http://127.0.0.1:8000/api/v1/employees'

resp=requests.get(url)

if resp.status_code==200:
    btEmp=resp.json()
    df=pd.DataFrame(btEmp)
    if not df.empty:
        display(df)            
else:
    print('Failuer'+str(resp.status_code))

,id,first_name,last_name,gender,roles
0,6699c1bc-72fb-46d6-82c3-72c69145e5b8,John,David,male,[user]
1,95da6385-dd40-42bb-a11c-7e1c5a0f076f,Alice,Smith,female,[admin]
2,6244f964-2a9a-4b2f-9713-5a6177c86958,James,Cameron,male,"[user, admin]"

In [4]:
import os
# print(__file__)
# _dir = os.path.dirname(os.path.abspath(__file__))
print("hello"+"world")

helloworld